In [2]:
import pandas as pd
import numpy as np
import re

pd.options.display.max_columns = None

### `Question-1:`

The dataset is based on NFTs. This is quite large. So, when you will read the dataset, you have to wait. The link of the dataset: https://tinyurl.com/2pfhncqw

Your task is to make a pivote table by using the columns "verification_status", "contract_type", "rarity_score" and "last_sale_price" to find out the total values.

In [ ]:
# code here

### `Question-2:`

You are given a dataset about the cars' price and miles driven of different cars throughout the different years. The link of the dataset: https://tinyurl.com/2r24n45l. Your tasks are
- make a pivot table of the brands (the required brands are given below) from the "Year" 2018 to the year 2022 in which the "Price" is shown as average values and "Miles" are in median values. In this pivote table, every row represents a particular brand and each column represents either average "Price" of a partucular year or median values of "Miles" of a particular year.
- At the end plot a kde chart for the "Price" and "Miles" by using your pivot table.

There are some challenges to solve this task:
- There is no column that is represented to the brand name of the car. You have to find out on your own.
- Some values of "Years" column are misleading. You have to reset this column too that every value should tell a valid meaning.

In [8]:
# code here
link = "https://tinyurl.com/2r24n45l"
car_df = pd.read_csv(link)

In [9]:
def fun(model):
    return model.split(" ")[0]
car_df['BrandName'] = car_df['Name'].apply(fun)

In [16]:
len(str(car_df.Year.unique()[4]))

5

In [14]:
car_df=car_df[(car_df['Year']>=2018) & (car_df['Year']<=2022)]
pd.pivot_table(car_df,index=['Name'],columns=['Year'],aggfunc={'Price':'mean','Miles':'median'},values=['Price','Miles'])

                                      Miles                             \
Year                                   2018     2019     2020     2021
Name
Acura ILX                           32516.0      NaN      NaN      NaN
Acura MDX                           86981.0  50959.0      NaN      NaN
Acura MDX Sport Hybrid                  NaN  32675.0      NaN      NaN
Acura RDX                               NaN  26612.0  30894.0  10922.0
Alfa Romeo Giulia                   22441.0  20928.0      NaN      NaN
...                                     ...      ...      ...      ...
Volkswagen Passat                   48021.0  47135.0  32237.0  28162.0
Volkswagen Tiguan                   48034.0  53383.0  45395.0  44425.0
Volkswagen Tiguan Limited           48794.0      NaN      NaN      NaN
smart fortwo electric drive         20157.5      NaN      NaN      NaN
smart fortwo electric drive cabrio  14825.0      NaN      NaN      NaN

                                                    Price                \
Year                                   2022          2018          2019
Name
Acura ILX                               NaN  23990.000000           NaN
Acura MDX                               NaN  27990.000000  31590.000000
Acura MDX Sport Hybrid                  NaN           NaN  42990.000000
Acura RDX                               NaN           NaN  34542.200000
Alfa Romeo Giulia                       NaN  29990.000000  30690.000000
...                                     ...           ...           ...
Volkswagen Passat                       NaN  20554.705882  23190.000000
Volkswagen Tiguan                   23096.0  21377.500000  24660.588235
Volkswagen Tiguan Limited               NaN  19590.000000           NaN
smart fortwo electric drive             NaN  16940.000000           NaN
smart fortwo electric drive cabrio      NaN  18590.000000           NaN


Year                                        2020          2021     2022
Name
Acura ILX                                    NaN           NaN      NaN
Acura MDX                                    NaN           NaN      NaN
Acura MDX Sport Hybrid                       NaN           NaN      NaN
Acura RDX                           37590.000000  43856.666667      NaN
Alfa Romeo Giulia                            NaN           NaN      NaN
...                                          ...           ...      ...
Volkswagen Passat                   25590.000000  25290.000000      NaN
Volkswagen Tiguan                   24144.818182  26675.714286  29590.0
Volkswagen Tiguan Limited                    NaN           NaN      NaN
smart fortwo electric drive                  NaN           NaN      NaN
smart fortwo electric drive cabrio           NaN           NaN      NaN

[231 rows x 10 columns]

### `Question-3:`

You are given a dataset of **Daily Power Generation in India** of regional wise of all Power Stations. Link of the dataset: https://tinyurl.com/2nq6kugt

Task
- In this dataset, there are many columns. Two of them are `Actual(MU)` and `Excess(+) / Shortfall (-)`. `Actual(MU)` represents the actual power generation. `Excess(+) / Shortfall (-)` tells is that generated power is excess or shortfall for that particular day of a power station. You have to find out what should be the actual power generation required for that day by the power stations that there would not be any excess or shorfall power. For the result, make a new column.
- Find out the month of the day and store it as a new column.
- Find out top 10 frequently appeared power stations in this dataframe.
- Next create a pivot table of which every row represents a power station and every column represents a month in a order. Like January, February, March...
- It is hard to get inside if you look through the only pivot table. So plot the pivot table.

In [70]:
# code here
df = pd.read_csv("https://tinyurl.com/2nq6kugt")
df.head()

,Dates,Power Station,Monitored Cap.(MW),Total Cap. Under Maintenace (MW),Planned Maintanence (MW),Forced Maintanence(MW),Other Reasons (MW),Programme or Expected(MU),Actual(MU),Excess(+) / Shortfall (-),Deviation
0,2017-09-01,Delhi,2235.4,135.00,0.00,135.0,0,13,18,5.00,0.0
1,2017-09-01,Haryana,2720.0,2470.00,0.00,2470.0,0,28,7,-21.80,0.0
2,2017-09-01,Himachal Pradesh,3378.0,379.00,0.00,231.0,0,40,46,5.63,0.0
3,2017-09-01,Jammu and Kashmir,1285.0,150.00,0.00,0.0,0,14,23,9.43,0.0
4,2017-09-01,Punjab,3826.3,2697.65,77.65,2620.0,0,39,17,-21.69,0.0

In [94]:
# You have to find out what should be the actual power generation required for that day by the power stations 
# that there would not be any excess or shorfall power. For the result, make a new column.
# def expected(e_mu,a_mu):
#     if e_mu == a_mu:
#         return True
#     else:
#         return False

# df[df["Programme or Expected(MU)"] == df["Actual(MU)"]]

df["Expected_meet"] = df.apply(lambda x: "True" if x["Programme or Expected(MU)"]==x["Actual(MU)"] else "False",axis=1)
df.head()

,Dates,Power Station,Monitored Cap.(MW),Total Cap. Under Maintenace (MW),Planned Maintanence (MW),Forced Maintanence(MW),Other Reasons (MW),Programme or Expected(MU),Actual(MU),Excess(+) / Shortfall (-),Deviation,Expected_meet
0,2017-09-01,Delhi,2235.4,135.00,0.00,135.0,0,13,18,5.00,0.0,False
1,2017-09-01,Haryana,2720.0,2470.00,0.00,2470.0,0,28,7,-21.80,0.0,False
2,2017-09-01,Himachal Pradesh,3378.0,379.00,0.00,231.0,0,40,46,5.63,0.0,False
3,2017-09-01,Jammu and Kashmir,1285.0,150.00,0.00,0.0,0,14,23,9.43,0.0,False
4,2017-09-01,Punjab,3826.3,2697.65,77.65,2620.0,0,39,17,-21.69,0.0,False

In [86]:
df.Expected_meet.unique()

array([nan], dtype=object)

In [12]:
# Find out the month of the day and store it as a new column.abs

def fun(date):
    return pd.Timestamp(date).month

df["Month"]= df.Dates.apply(fun)

NameError: name 'df' is not defined

In [169]:
# Find out top 10 frequently appeared power stations in this dataframe.
df["Power Station"].value_counts().head(10)

Power Station
NTPC Ltd.    9570
NHPC         5742
NPCIL        5742
GMR ENERG    5742
JSWEL        3828
TATA PCL     3828
IBPIL        3828
APL          3828
JPPVL        3828
NLC          3828
Name: count, dtype: int64

In [173]:
df.head()

,Dates,Power Station,Monitored Cap.(MW),Total Cap. Under Maintenace (MW),Planned Maintanence (MW),Forced Maintanence(MW),Other Reasons (MW),Programme or Expected(MU),Actual(MU),Excess(+) / Shortfall (-),Deviation,Month
0,2017-09-01,Delhi,2235.4,135.00,0.00,135.0,0,13,18,5.00,0.0,9
1,2017-09-01,Haryana,2720.0,2470.00,0.00,2470.0,0,28,7,-21.80,0.0,9
2,2017-09-01,Himachal Pradesh,3378.0,379.00,0.00,231.0,0,40,46,5.63,0.0,9
3,2017-09-01,Jammu and Kashmir,1285.0,150.00,0.00,0.0,0,14,23,9.43,0.0,9
4,2017-09-01,Punjab,3826.3,2697.65,77.65,2620.0,0,39,17,-21.69,0.0,9

In [177]:
# Next create a pivot table of which every row represents a power station and every column represents a month in a order. Like January, February, March...


df.pivot_table(index="Power Station",columns="Month",values=["Monitored Cap.(MW)","Total Cap. Under Maintenace (MW)"], aggfunc="mean")

              Monitored Cap.(MW)                                           \
Month                         1           2            3       4       5
Power Station
0                            NaN         NaN          NaN     NaN     NaN
ABAN POWR             119.800000   119.80000   119.800000   119.8   119.8
ACB                   325.000000   325.00000   325.000000   325.0   325.0
ACPL                    0.000000     0.00000     0.000000     0.0     0.0
ADHPL                 192.000000   192.00000   192.000000   192.0   192.0
...                          ...         ...          ...     ...     ...
VESPL                  35.000000    35.00000    35.000000    35.0    35.0
VIP                   600.000000   600.00000   600.000000   600.0   600.0
VVL                   135.000000   135.00000   135.000000   135.0   135.0
WPCL                 2270.322581  2340.00000  2340.000000  2340.0  2340.0
West Bengal          6443.870968  6423.51773  6398.523364  6321.0  6291.0

                                                                      \
Month              6            7            8       9            10
Power Station
0                 NaN          NaN          NaN     NaN  1201.912792
ABAN POWR       119.8   119.800779   119.800129   119.8   119.800000
ACB             325.0   325.000000   325.000000   325.0   325.000000
ACPL              0.0     0.000000     0.000000     0.0     0.000000
ADHPL           192.0   192.000000   192.000000   192.0   192.000000
...               ...          ...          ...     ...          ...
VESPL            35.0    35.000000    35.000000    35.0    35.000000
VIP             600.0   600.000000   600.000000   600.0   600.000000
VVL             135.0   135.000000   135.000000   135.0   135.000000
WPCL           2340.0  2340.000000  2340.000000  2240.0  2230.909091
West Bengal    6304.0  6306.779221  6304.000000  6351.0  6349.729730

                                        Total Cap. Under Maintenace (MW)  \
Month                   11           12                               1
Power Station
0                      NaN          NaN                              NaN
ABAN POWR       119.800000   119.800000                        34.007742
ACB             325.000000   325.000000                       126.129032
ACPL              0.000000     0.000000                         0.000000
ADHPL           192.000000   192.000000                        58.838710
...                    ...          ...                              ...
VESPL            35.000000    35.000000                        35.000000
VIP             600.000000   600.000000                       450.967742
VVL             135.000000   135.000000                       135.000000
WPCL           2242.793296  2234.915254                       790.548387
West Bengal    6349.687151  6375.152542                      1828.645161

                                                                             \
Month                   2            3            4            5         6
Power Station
0                      NaN          NaN          NaN          NaN       NaN
ABAN POWR        19.541844     3.918692    36.938333    21.819355    19.168
ACB             105.638298   108.621495   119.375000   110.282258    88.700
ACPL              0.000000     0.000000     0.000000     0.000000     0.000
ADHPL            15.659574    15.252336    11.200000    17.032258     7.040
...                    ...          ...          ...          ...       ...
VESPL            35.000000    35.000000    35.000000    35.000000    35.000
VIP             540.425532   525.700935   525.000000   520.161290   522.000
VVL             135.000000   135.000000   135.000000   135.000000   135.000
WPCL            860.425532   782.873832   529.750000   580.524194  1019.600
West Bengal    1798.925532  1622.107477  1218.145833  1410.076613  1487.080

                                                                   \
Month                   7            8            9            10
Power Station
0                      NaN          NaN          NaN   367.576438
ABAN POWR        17.892208    17.325161    13.976667    22.507879
ACB             108.474026   132.709677   142.583333   129.181818
ACPL              0.000000     0.000000     0.000000     0.000000
ADHPL             1.246753    27.251613    33.600000    43.054545
...                    ...          ...          ...          ...
VESPL            35.000000    35.000000    33.833333    35.000000
VIP             525.974026   540.000000   440.000000   423.636364
VVL             135.000000   135.000000   130.500000   135.000000
WPCL            747.954545   683.709677   814.583333   668.636364
West Bengal    1735.068182  2061.867742  1829.544444  1710.286486


Month                   11           12
Power Station
0                      NaN          NaN
ABAN POWR        48.856983    55.500565
ACB             103.603352   110.762712
ACPL              0.000000     0.000000
ADHPL            34.860335    90.576271
...                    ...          ...
VESPL            35.000000    35.000000
VIP             434.078212   394.915254
VVL             135.000000   135.000000
WPCL            947.765363   759.661017
West Bengal    1969.544693  1844.988701

[182 rows x 24 columns]

###`Q-4` You are given a file `question-answer.csv`. Your task is to make a dataframe from it with two columns - `question` and `answers`.

* Questions in the file start from `Q<number>`; E.g.  `Q1` denotes question no. `1`
* Answers starts from `Ans<number>`; Eg. `Ans1` denotes answer of question no `1`
* MAke sure you look at columns name carefully

CSV File - "https://drive.google.com/file/d/10rmV3XrVtzpDTtYZF3UtCdcU0ajBJjGY/view?usp=share_link"

In [205]:
# code here
df = pd.read_csv("question-answer.csv")
df.shape

(20, 2)

###`Q-5`: Print Question and answer of those questions which does not contains any question mark (`?`).

In [238]:
df[(df.iloc[:,1].str.contains(r'\?'))].iloc[9,1]

'Q10-What are the different types of joins? What are the differences between them?'

In [197]:
questions = df[df.iloc[:, 1].str.contains("Q", na=False)]
answers = df[df.iloc[:, 1].str.contains("Ans", na=False)]

# Reset index to align rows
questions = questions.reset_index(drop=True)
answers = answers.reset_index(drop=True)

# Create a new DataFrame pairing them
df_q = pd.DataFrame({
    "Question": questions.iloc[:, 1],
    "Answer": answers.iloc[:, 1]
})

In [201]:
df_q.head(30)

,Question,Answer
0,Q1-What is Data Science?,"Ans1-Data Science combines statistics, maths, ..."
1,Q2-2. How is logistic regression done?,Ans2-Logistic regression measures the relation...
2,Q3-How do you build a random forest model?,Ans3-A random forest is built up of a number o...
3,Q4-How can you avoid overfitting your model?,Ans4-Overfitting refers to a model that is onl...
4,Q5-You are given a data set consisting of vari...,Ans5-The following are ways to handle missing ...
5,Q6-What is bag of words? How we can use it for...,Ans6-Bag of Words is a representation of text ...
6,Q7-How can we use machine learning for text cl...,Ans7-Machine learning classification algorithm...
7,Q8-What is a time series?,Ans8-A time series is a set of observations or...
8,Q9-How is time series different from the usual...,Ans9-The principle behind causal forecasting i...
9,Q10-What are the different types of joins? Wha...,Ans10-(INNER) JOIN: Returns records that have ...

###`Q 6-10` LOG and EMPLOYEE

6. Show `activity` details month wise. Show count for each `activity`
7. Find employee who did most `activity` in January month.
8. Employee who have worked most no of times on Weekends.
9. Which activity is logged most on buisness days.
10. Week Days wise activity table.
```
log_file = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vT-OMrmmNdOTM-B5f5F1EpCutMVG230UZiLvqlsg0NIKUKR3yrqiI2r1pEX-LvSEk-3WwySPYtvbBC-/pub?gid=1937029224&single=true&output=csv")
employee = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vQ5AuFqRjSZVBKm5zyDxquX6utubq1DJKkYDI70vjeidAnyAu70KMSYpMYzeVSNVTeUIJBpfF6jU5E6/pub?gid=798824749&single=true&output=csv")

```

Note(for common field):- Employee file has `EMPLOYEE_ID` and LOG file has `emp_id`

In [4]:
# code here
log_file = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vT-OMrmmNdOTM-B5f5F1EpCutMVG230UZiLvqlsg0NIKUKR3yrqiI2r1pEX-LvSEk-3WwySPYtvbBC-/pub?gid=1937029224&single=true&output=csv")
employee = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vQ5AuFqRjSZVBKm5zyDxquX6utubq1DJKkYDI70vjeidAnyAu70KMSYpMYzeVSNVTeUIJBpfF6jU5E6/pub?gid=798824749&single=true&output=csv")

In [8]:
log_file.head()

   Log_ID          dt   dept  emp_id    activity       eqpt
0    1000  2022-01-07  Dept6     115    Cleaning        UPS
1    1001  2022-01-08  Dept4     105    Cleaning  Generator
2    1002  2022-01-09  Dept3     112  Inspection        CPU
3    1003  2022-01-10  Dept4     120  Inspection        UPS
4    1004  2022-01-11  Dept3     138    Checking    Battery

In [14]:
def fun(date):
    return pd.Timestamp(date).month
log_file["month"] = log_file.dt.apply(fun)

In [267]:
# Show activity details month wise. Show count for each activity
log_file.groupby(["month","activity"])["activity"].count().unstack(level=0)

activity
Checking       7
Cleaning      10
Inspection     9
Repair         5
Name: 1, dtype: int64

In [16]:
employee.head()

   EMPLOYEE_ID FIRST_NAME LAST_NAME     EMAIL
0          100     Steven      King     SKING
1          101      Neena   Kochhar  NKOCHHAR
2          102        Lex   De Haan   LDEHAAN
3          103  Alexander    Hunold   AHUNOLD
4          104      Bruce     Ernst    BERNST

In [18]:
df = log_file.merge(employee, left_on="emp_id",right_on="EMPLOYEE_ID")
df.head()

,Log_ID,dt,dept,emp_id,activity,eqpt,month,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL
0,1000,2022-01-07,Dept6,115,Cleaning,UPS,1,115,Alexander,Khoo,AKHOO
1,1001,2022-01-08,Dept4,105,Cleaning,Generator,1,105,David,Austin,DAUSTIN
2,1002,2022-01-09,Dept3,112,Inspection,CPU,1,112,NaN,Urman,JMURMAN
3,1003,2022-01-10,Dept4,120,Inspection,UPS,1,120,Matthew,Weiss,MWEISS
4,1004,2022-01-11,Dept3,138,Checking,Battery,1,138,Stephen,Stiles,SSTILES

In [40]:
# Employee who have worked most no of times on Weekends.
date = pd.Timestamp("2025-05-12")
date.weekday() 
date.day_name()

'Monday'

In [44]:
def conv_week(dt):
    return pd.Timestamp(dt).weekday()
df["WeekDay"] = df.dt.apply(conv_week)
df.head()

,Log_ID,dt,dept,emp_id,activity,eqpt,month,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,WeekDay
0,1000,2022-01-07,Dept6,115,Cleaning,UPS,1,115,Alexander,Khoo,AKHOO,4
1,1001,2022-01-08,Dept4,105,Cleaning,Generator,1,105,David,Austin,DAUSTIN,5
2,1002,2022-01-09,Dept3,112,Inspection,CPU,1,112,NaN,Urman,JMURMAN,6
3,1003,2022-01-10,Dept4,120,Inspection,UPS,1,120,Matthew,Weiss,MWEISS,0
4,1004,2022-01-11,Dept3,138,Checking,Battery,1,138,Stephen,Stiles,SSTILES,1

In [66]:
week_emp = df[(df["WeekDay"]==5) | (df["WeekDay"]==6)]
# week_emp.groupby("emp_id")["WeekDay"].count().sort_values(ascending=False)
df[df["emp_id"]==week_emp.emp_id.value_counts().idxmax()]

,Log_ID,dt,dept,emp_id,activity,eqpt,month,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,WeekDay
12,1016,2022-01-23,Dept2,109,Cleaning,Generator,1,109,Daniel,Faviet,DFAVIET,6
31,1037,2022-02-13,Dept1,109,Repair,UPS,2,109,Daniel,Faviet,DFAVIET,6
50,1058,2022-03-06,Dept4,109,Repair,Generator,3,109,Daniel,Faviet,DFAVIET,6
107,1132,2022-05-19,Dept3,109,Inspection,UPS,5,109,Daniel,Faviet,DFAVIET,3
171,1213,2022-08-08,Dept2,109,Inspection,Fan,8,109,Daniel,Faviet,DFAVIET,0
178,1221,2022-08-16,Dept6,109,Cleaning,Generator,8,109,Daniel,Faviet,DFAVIET,1
186,1229,2022-08-24,Dept2,109,Inspection,CPU,8,109,Daniel,Faviet,DFAVIET,2
205,1249,2022-09-13,Dept2,109,Repair,CPU,9,109,Daniel,Faviet,DFAVIET,1
238,1291,2022-10-25,Dept6,109,Cleaning,CPU,10,109,Daniel,Faviet,DFAVIET,1
248,1304,2022-11-07,Dept2,109,Cleaning,Pump,11,109,Daniel,Faviet,DFAVIET,0
257,1316,2022-11-19,Dept6,109,Repair,Fan,11,109,Daniel,Faviet,DFAVIET,5
258,1317,2022-11-20,Dept6,109,Checking,Server,11,109,Daniel,Faviet,DFAVIET,6
277,1341,2022-12-14,Dept2,109,Repair,Battery,12,109,Daniel,Faviet,DFAVIET,2

### `Q-11`:

1. There are missing value in first name of employee. Fill it using email and last name field.

> E.g- `email` -> JMURMAN and `last_name` -> 'Urman' -> so make it's first name as 'JM', Sort of (Email- lastname).

> Email is constructed from initials of first name concate with lastname. Your Task is to fill first name initials in missing data.

2. You can see email field don't have any domain name. Change this to full email addreess with domain as 'campusx.com'.
E.g- Email field -> `JMURMAN`  result -> `JMURMAN@CAMPUSX.COM`

3. Show Full Name of all the employees whose name starts with 'A' and has done any of these activity ['Incpection', 'Cleaning', 'Checking]

In [ ]:
# code here

In [38]:
from datetime import datetime as dt
dt.datetime("5/9/2025")

AttributeError: type object 'datetime.datetime' has no attribute 'datetime'

In [31]:
from datetime import datetime

date_str = "5/9/2025"
date_obj = datetime.strptime(date_str, "%m/%d/%Y")
print(date_obj)

2025-05-09 00:00:00

In [42]:
date = "5/9/2025" 

np.datetime64(date)

ValueError: Error parsing datetime string "5/9/2025" at position 1

In [46]:
import numpy as np
date = "5/9/2025"
date_obj = np.datetime64(date)

ValueError: Error parsing datetime string "5/9/2025" at position 1

## Time stemp

In [71]:
pd.Timestamp("5, 12, 2025")

Timestamp('2025-05-12 00:00:00')

In [136]:
tm = pd.Timestamp("today")
tm

Timestamp('2025-05-09 17:13:13.365450')

In [61]:
temp = pd.Timestamp("5-9-2025")

In [63]:
temp.year

2025

In [65]:
temp.day

9